public/man/man1/flatpak-override.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-override.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-override.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-override - Override application requirements</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak override</strong> [OPTION…] [APP]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Overrides the application specified runtime requirements. This can be
used to grant a sandboxed application more or less resources than it
requested.</p>
<p>
By default the application gets access to the resources it requested
when it is started. But the user can override it on a particular
instance by specifying extra arguments to <strong>flatpak run</strong>, or every time
by using <strong>flatpak override</strong>.</p>
<p>
If the application ID APP is not specified then the overrides affect all
applications, but the per-application overrides can override the global
overrides.</p>
<p>
Unless overridden with the <strong>–user</strong> or <strong>–installation</strong> options, this
command changes the default system-wide installation.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–user</strong></p>
<blockquote>
<p>Update a per-user installation.</p>
</blockquote>
<p>
<strong>–system</strong></p>
<blockquote>
<p>Update the default system-wide installation.</p>
</blockquote>
<p>
<strong>–installation=NAME</strong></p>
<blockquote>
<p>Updates a system-wide installation specified by NAME among those defined
in <em>etc/flatpak/installations.d</em>. Using <strong>–installation=default</strong> is
equivalent to using <strong>–system</strong>.</p>
</blockquote>
<p>
<strong>–share=SUBSYSTEM</strong></p>
<blockquote>
<p>Share a subsystem with the host session. This overrides the Context
section from the application metadata. SUBSYSTEM must be one of:
network, ipc. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–unshare=SUBSYSTEM</strong></p>
<blockquote>
<p>Dont share a subsystem with the host session. This overrides the Context
section from the application metadata. SUBSYSTEM must be one of:
network, ipc. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–socket=SOCKET</strong></p>
<blockquote>
<p>Expose a well-known socket to the application. This overrides to the
Context section from the application metadata. SOCKET must be one of:
x11, wayland, fallback-x11, pulseaudio, system-bus, session-bus,
ssh-auth, pcsc, cups, gpg-agent. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–nosocket=SOCKET</strong></p>
<blockquote>
<p>Dont expose a well-known socket to the application. This overrides to
the Context section from the application metadata. SOCKET must be one
of: x11, wayland, fallback-x11, pulseaudio, system-bus, session-bus,
ssh-auth, pcsc, cups, gpg-agent. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–device=DEVICE</strong></p>
<blockquote>
<p>Expose a device to the application. This overrides to the Context
section from the application metadata. DEVICE must be one of: dri, kvm,
shm, all. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–nodevice=DEVICE</strong></p>
<blockquote>
<p>Dont expose a device to the application. This overrides to the Context
section from the application metadata. DEVICE must be one of: dri, kvm,
shm, all. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–allow=FEATURE</strong></p>
<blockquote>
<p>Allow access to a specific feature. This updates the [Context] group in
the metadata. FEATURE must be one of: devel, multiarch, bluetooth,
canbus, per-app-dev-shm. This option can be used multiple times.</p>
<p>
See *flatpak-build-finish*(1) for the meaning of the various features.</p>
</blockquote>
<p>
<strong>–disallow=FEATURE</strong></p>
<blockquote>
<p>Disallow access to a specific feature. This updates the [Context] group
in the metadata. FEATURE must be one of: devel, multiarch, bluetooth,
canbus, per-app-dev-shm. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–filesystem=FILESYSTEM</strong></p>
<blockquote>
<p>Allow the application access to a subset of the filesystem. This
overrides to the Context section from the application metadata.
FILESYSTEM can be one of: home, host, host-os, host-etc, xdg-desktop,
xdg-documents, xdg-download, xdg-music, xdg-pictures, xdg-public-share,
xdg-templates, xdg-videos, xdg-run, xdg-config, xdg-cache, xdg-data, an
absolute path, or a homedir-relative path like ~/dir or paths relative
to the xdg dirs, like xdg-download/subdir. The optional :ro suffix
indicates that the location will be read-only. The optional :create
suffix indicates that the location will be read-write and created if it
doesnt exist. This option can be used multiple times. See the &#34;[Context]
filesystems&#34; list in *flatpak-metadata*(5) for details of the meanings
of these filesystems.</p>
</blockquote>
<p>
<strong>–nofilesystem=FILESYSTEM</strong></p>
<blockquote>
<p>Undo the effect of a previous *–filesystem=*FILESYSTEM in the apps
manifest or a lower-precedence layer of overrides, and/or remove a
previous *–filesystem=*FILESYSTEM from this layer of overrides. This
overrides the Context section of the application metadata. FILESYSTEM
can take the same values as for <strong>–filesystem</strong>, but the :ro and :create
suffixes are not used here. This option can be used multiple times.</p>
<p>
This option does not prevent access to a more narrowly-scoped
<strong>–filesystem</strong>. For example, if an application has the equivalent of
<strong>–filesystem=xdg-config/MyApp</strong> in its manifest or as a system-wide
override, and flatpak override –user –nofilesystem=home as a per-user
override, then it will be prevented from accessing most of the home
directory, but it will still be allowed to access
$XDG_CONFIG_HOME/MyApp.</p>
<p>
As a special case, <strong>–nofilesystem=host:reset</strong> will ignore all
<strong>–filesystem</strong> permissions inherited from the app manifest or a
lower-precedence layer of overrides, in addition to having the behaviour
of <strong>–nofilesystem=host</strong>.</p>
</blockquote>
<p>
<strong>–add-policy=SUBSYSTEM.KEY=VALUE</strong></p>
<blockquote>
<p>Add generic policy option. For example, &#34;–add-policy=subsystem.key=v1
–add-policy=subsystem.key=v2&#34; would map to this metadata:</p>
<blockquote>
<pre class="example">
[Policy subsystem]
key=v1;v2;
</pre>
</blockquote>
<p>
This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–remove-policy=SUBSYSTEM.KEY=VALUE</strong></p>
<blockquote>
<p>Remove generic policy option. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–env=VAR=VALUE</strong></p>
<blockquote>
<p>Set an environment variable in the application. This overrides to the
Context section from the application metadata. This option can be used
multiple times.</p>
</blockquote>
<p>
<strong>–unset-env=VAR</strong></p>
<blockquote>
<p>Unset an environment variable in the application. This overrides the
unset-environment entry in the [Context] group of the metadata, and the
[Environment] group. This option can be used multiple times.</p>
</blockquote>
<p>
*–env-fd=*/FD/</p>
<blockquote>
<p>Read environment variables from the file descriptor <em>FD</em>, and set them
as if via <strong>–env</strong>. This can be used to avoid environment variables and
their values becoming visible to other users.</p>
<p>
Each environment variable is in the form <em>VAR/=/VALUE</em> followed by a
zero byte. This is the same format used by env -0 and /proc/*/environ.</p>
</blockquote>
<p>
<strong>–own-name=NAME</strong></p>
<blockquote>
<p>Allow the application to own the well-known name NAME on the session
bus. This overrides to the Context section from the application
metadata. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–talk-name=NAME</strong></p>
<blockquote>
<p>Allow the application to talk to the well-known name NAME on the session
bus. This overrides to the Context section from the application
metadata. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–no-talk-name=NAME</strong></p>
<blockquote>
<p>Dont allow the application to talk to the well-known name NAME on the
session bus. This overrides to the Context section from the application
metadata. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–system-own-name=NAME</strong></p>
<blockquote>
<p>Allow the application to own the well known name NAME on the system bus.
If NAME ends with .*, it allows the application to own all matching
names. This overrides to the Context section from the application
metadata. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–system-talk-name=NAME</strong></p>
<blockquote>
<p>Allow the application to talk to the well known name NAME on the system
bus. If NAME ends with .*, it allows the application to talk to all
matching names. This overrides to the Context section from the
application metadata. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–system-no-talk-name=NAME</strong></p>
<blockquote>
<p>Dont allow the application to talk to the well known name NAME on the
system bus. If NAME ends with .*, it allows the application to talk to
all matching names. This overrides to the Context section from the
application metadata. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–persist=FILENAME</strong></p>
<blockquote>
<p>If the application doesnt have access to the real homedir, make the
(homedir-relative) path FILENAME a bind mount to the corresponding path
in the per-application directory, allowing that location to be used for
persistent data. This overrides to the Context section from the
application metadata. This option can be used multiple times.</p>
</blockquote>
<p>
<strong>–reset</strong></p>
<blockquote>
<p>Remove overrides. If an APP is given, remove the overrides for that
application, otherwise remove the global overrides.</p>
</blockquote>
<p>
<strong>–show</strong></p>
<blockquote>
<p>Shows overrides. If an APP is given, shows the overrides for that
application, otherwise shows the global overrides.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>$ flatpak override –nosocket=wayland org.gnome.gedit</strong></p>
<p>
<strong>$ flatpak override –filesystem=home org.mozilla.Firefox</strong></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*flatpak*(1), *flatpak-run*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
